import { Breadcrumbs } from '../ui';

export default function PaymentsAndDeliveryPage() {
  return (
    <>
      <Breadcrumbs pageName="Оплата і доставка" />

      <div className="grid gap-4 text-sm leading-normal md:grid-cols-2 md:text-base">
        <div className="space-y-2">
          <h2 className="text-2xl font-bold md:text-3xl">Доставка товару</h2>
          <div className="space-y-2">
            <p>
              Відправлення замовлень здійснюється щоденно. У разі надходження оплати до 16:00 —
              товар відправляється в той самий день. Доставка охоплює всю територію України та
              виконується за допомогою перевізника — <b className="font-semibold">Нова Пошта</b>.
            </p>
            <p className="font-semibold">Умови доставки:</p>
            <ul className="space-y-2">
              <li>
                <p>
                  <b className="font-semibold">Доставка до відділення Нової Пошти</b> — від 70 грн
                </p>
                <p>
                  Орієнтовний термін доставки: <b className="font-semibold">1–3 робочих дні.</b>
                </p>
              </li>
              <li>
                <p>
                  <b className="font-semibold">Адресна доставка кур’єром Нової Пошти</b> — від 100
                  грн
                </p>
                <p>
                  Орієнтовний термін доставки: <b className="font-semibold">1–3 робочих дні.</b>
                </p>
              </li>
            </ul>
            <p>
              Усі вартість та строки доставки визначаються відповідно до чинних тарифів транспортної
              компанії.
            </p>
            <div className="mt-3">
              <h3 className="text-lg font-bold">Страхування вантажу</h3>
              <p>
                З метою гарантії безпеки відправлень та можливості отримання компенсації у разі
                пошкодження чи втрати товару під час транспортування, кожне відправлення обов’язково
                страхується на повну вартість. Якщо ви бажаєте відмовитися від страхування, просимо
                повідомити про це під час оформлення замовлення. У протилежному випадку страхування
                буде застосовано за замовчуванням.
              </p>
            </div>
          </div>
        </div>
        <div className="space-y-2">
          <h2 className="text-2xl font-bold">Оплата товару</h2>
          <p>Для здійснення покупки в нашому інтернет-магазині доступні наступні способи оплати:</p>
          <ul className="space-y-2">
            <li>
              <b className="font-semibold">Переказ на банківський рахунок</b> — реквізити надаються
              після підтвердження замовлення менеджером. Оплата вважається здійсненою після
              надходження повної суми на рахунок компанії.
            </li>
            <li>
              <b className="font-semibold">Післяплата (накладений платіж)</b> — можливе здійснення
              оплати при отриманні товару у відділенні перевізника (Нова Пошта). У цьому випадку
              стягується додаткова комісія згідно з тарифами транспортної компанії.
            </li>
          </ul>
          <p>
            <b className="font-semibold">Звертаємо увагу:</b> відправлення товару здійснюється після
            підтвердження надходження коштів, окрім випадків оплати при отриманні. Усі платежі є
            конфіденційними та захищені згідно з чинним законодавством України.
          </p>
        </div>
      </div>
    </>
  );
}
